<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"fe15bb0799a5ddadd55bd4f6f00a94db52c3f2b634f8cf74c13de2d472680afb","plan_job_ref":"Job Terraform plan #13 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8124204684","plan_out_hash":"7d9a20c328d28cfe0f98c7f8a6f96b16dd90e886946455023ff3d38716215485","plan_hash":"88e92429c29ba312badb96b4c04eef201ab668214692134c924805b0355d33d0","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # yandex_storage_bucket.bucket is tainted, so must be replaced
-/+ resource "yandex_storage_bucket" "bucket" {
!~      bucket_domain_name    = "movie-recognizer.storage.yandexcloud.net" -> (known after apply)
!~      default_storage_class = "STANDARD" -> (known after apply)
!~      folder_id             = "********************" -> (known after apply)
!~      id                    = "****************" -> (known after apply)
-       max_size              = 0 -> null
-       tags                  = {} -> null
+       website_domain        = (known after apply)
+       website_endpoint      = (known after apply)
#        (4 unchanged attributes hidden)

-       anonymous_access_flags {
-           config_read = false -> null
-           list        = false -> null
-           read        = false -> null
        }

+       grant {
+           id          = "aje4bqsa9iv6piqm1tmk"
+           permissions = [
+               "READ",
+               "WRITE",
            ]
+           type        = "CanonicalUser"
        }

-       versioning {
-           enabled = false -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:x: Error applying plan in [Terraform apply #3](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8124214875)